; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	thermograph0 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation3 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite3 Phenomenon11)
	(have_image Planet7 image1)
	(have_image Planet8 image1)
	(have_image Star9 thermograph0)
	(have_image Star10 image1)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (turn_to satellite3 groundstation5 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 groundstation5)
   goals met: 0 of 8
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite3 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite3 planet8 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 planet8)
   goals met: 0 of 8
5. (take_image satellite3 planet8 instrument4 image1)
   added: (have_image planet8 image1)
   goals met: 1 of 8
6. (turn_to satellite3 planet7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet7)
   goals met: 1 of 8
7. (take_image satellite3 planet7 instrument4 image1)
   added: (have_image planet7 image1)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon13 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon13 instrument4 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 8
10. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 3 of 8
11. (take_image satellite3 phenomenon12 instrument4 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 8
12. (turn_to satellite3 star10 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 star10)
   goals met: 4 of 8
13. (take_image satellite3 star10 instrument4 image1)
   added: (have_image star10 image1)
   goals met: 5 of 8
14. (turn_to satellite3 star9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star9)
   goals met: 5 of 8
15. (take_image satellite3 star9 instrument4 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 6 of 8
16. (turn_to satellite3 phenomenon11 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon11)
   goals met: 7 of 8
17. (take_image satellite3 phenomenon11 instrument4 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 8 of 8
